"done" = "Done";
"code" = "Code";
"ok" = "Ok";
"identifyReason" = "Identification";

// ERRORS
"alertTitleError" = "ERROR";
"alertMessage000" = "An error has occurred";
"alertMessage001" = "The digital key must be alphanumeric, contain an uppercase letter, a lowercase letter and a number between 8 and 24 characters long..";

// PSD2 ERROR
"PSD2ErrorDataTitle" = "The inserted data are not correct";
"PSD2ErrorDataMessage1" = "An error occurred. You have ";
"PSD2ErrorDataMessage2" = " attempts";

// BIOMETRIC ALERT
"titleBiometricAccessAlert" = "Biometric access";
"messageBiometricAccessAlert" = "Do you want to use your fingerprint or Face ID to operate?";
"okButtonBiometricAccess" = "YES, I WANT";
"koButtonBiometricAccess"  = "NO, THANKS";

// PENDING PURCHASE
"titlePendingPurchase" = "Enter the code we just sent you";
"acceptButtonPendingPurchase" = "ACCEPT";
"rejectButtonPendingPurchase" = "CANCEL";

// INSERT DIGITAL KEY
"hintDigitalKey" = "Digital key";
"titleDigitalKey" = "Digital key";
"subTitleDigitalKey" = "We need you to enter your digital key";
"acceptButtonDigitalKey" = "ACCEPT";

// PSD2 VALIDATE
"titleIntroValidate" = "Action required";
"subtitleIntroValidate" = "To comply with the Payment Services Directive 2 (PSD2), which aims to improve security, we must request your digital key every 90 days to show you information regarding your card.";
"acceptButtonIntroValidate" = "ENTER KEY";

"titleOtpViewValidate" = "Code";
"subtitleOtpViewValidate" = "Before entering your digital key we need you to enter the code we have just sent you.";
"resendButtonOtpViewValidate" = "Resend code";
"acceptButtonOtpViewValidate" = "ACCEPT";

"forgotKeyButtonDigitalKeyViewValidate" = "I forgot my digital password";

// Enum Form
"btn_accept" = "ACCEPT";
"btn_create_key" = "CREATE KEY";
"btn_next" = "NEXT";
"btn_resend" = "Resend SMS";
"btn_enter_key" = "ENTER KEY";
"msg_error" = "ERROR";
"msg_cancel_process" = "Process cancelled";
"msg_failure" = "The operation could not be performed";
"msg_otp_resend" = "Code has been resent";
"msg_otp_wrong" = "The code is not correct";
"msg_remaining" = "An error occurred.  You have @% attempts remaining.";
"msg_sms_resend" = "The SMS with the code has been resent";
"msg_success" = "Successful operation";
"msg_server_error" = "An unexpected error has been detected on our servers, please try again later.";
"msg_try" = "Please try again or contact our customer service";
"msg_warning" = "Warning";
"fill_pwd_repeat" = "You must set the digital key and repeat it";
"fill_digital_key" = "You must fill in the digital key";
"fill_digital_key_invalid" = "Invalid digital key";
"fill_digital_key_equals" = "The digital keys must match";
"fill_digital_key_repeat" = "You must define the digital key and repeat it";

// PSD2 CREATE
"psd2_code_subtitle" = "Enter the code we just sent you";
"psd2_digital_key_setup" = "To finish setting up your account, we need you to create your digital key";
"psd2_mandatory_sca" = "The Payment Services Directive 2 (PSD2) aims to improve security and reduce fraud through Strong Customer Authentication (SCA). The digital key is mandatory for card transactions and mobile banking";
"psd2_digital_key_about" = "About the digital key";
"psd2_digital_key_create" = "Your digital key will be requested for card transactions and some app transactions. If you do not remember your digital key, you can create it again here.";
"psd2_code_receive" = "Enter the code we just sent you";
"psd2_code_new" = "Insert your new digital key";
"psd2_code_repeat" = "Repeat your new digital key";
"psd2_digital_key_new" = "New digital key";
"psd2_digital_key_change_failure"= "Your digital key has not been changed successfully";
"psd2_mandatory" = "To comply with the Payment Services Directive 2 (PSD2), which aims to improve security, we need to ask for your digital key every 90 days so that we can show you information about your card";
"psd2_digital_key_change_success" = "Digital key change successful";
"psd2_mandatory_personal" = "The digital key is personal and will never be requested through any channel (SMS, eMail or others, nor from our customer service. It will only be requested when you operate with your card and to consult your movements in the application";
"psd2_phone" = "Now enter your mobile phone number";
"psd2_phone_check" = "To verify your identity, please enter your mobile phone number";
"psd2_phone_number" = "Phone number";

// PSD2 MODIFY
"psd2_required" = "Action required";
"psd2_digital_key_generate" = "The digital key will be required for card transactions and some online banking transactions. \nIf you do not remember your PIN, you can generate a new one here.";
"psd2_code_insert" = "Insert code";
"psd2_insert_code" = "Before you enter your digital key we need you to enter the code we just sent you";
"psd2_digital_key_ok" = "Your digital key has been successfully created";
"psd2_digital_key" = "Digital key";
"psd2_digital_key_repeat" = "Repeat digital key";
"psd2_pwd_restrictions" = "Must be between 8 and 24 characters, one upper case, one lower case and one number";
"psd2_secret_code_match" = "The secret codes must match";
"psd2_secret_code_wrong" = "The inserted data is not correct";

// PSD2 Modify Phone
"msg_change_phone" = "Update mobile number";
"msg_cp_success" = "Mobile number updated successfully";
"msg_cp_success_s" = "We have saved your new mobile number, from now on you will receive notifications on this number";
"title_change_phone" = "What is your new mobile phone number?";
"title_change_phone_s" = "It is important that it is up to date so that you can operate normally";


